---
kind: type
id: T:Autodesk.Revit.DB.SolidCurveIntersectionOptions
source: html/fce58e1d-47c7-9afb-d701-ec73d97d0f2b.htm
---
# Autodesk.Revit.DB.SolidCurveIntersectionOptions

This class contains the options used to calculate the intersection between a solid and a curve.

## Syntax (C#)
```csharp
public class SolidCurveIntersectionOptions : IDisposable
```